RoarFPV/bl808-zig/src/microzig/chips/BL808/peripherals/zigcc/bl808.soc.cc.h
#define __BL808_H__ 

/** @addtogroup Configuration_section_for_RISCV
  * @{
  */

/**
  * @brief Configuration of the Processor and Core Peripherals
   */

#define CORE_ID_ADDRESS (0xF0000000)
#define CORE_ID_M0 (0xE9070000)
#define CORE_ID_D0 (0xDEAD5500)
#define CORE_ID_LP (0xDEADE902)

#define CORE_M0_JTAG_TCK_PIN (GLB_GPIO_PIN_27)
#define CORE_M0_JTAG_TMS_PIN (GLB_GPIO_PIN_28)
#define CORE_M0_JTAG_TCK_FUNC (GPIO_FUN_M_CJTAG)
#define CORE_M0_JTAG_TMS_FUNC (GPIO_FUN_M_CJTAG)

#define IPC_SYNC_ADDR1 0x40000000
#define IPC_SYNC_ADDR2 0x40000004
#define IPC_SYNC_FLAG 0x12345678

/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */
# 42 "../bouffalo_drivers/soc/bl808/std/include/hardware/bl808.h"
#define IRQ_NUM_BASE 16


/**
 * @brief BL808 Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */
typedef enum {
# 63 "../bouffalo_drivers/soc/bl808/std/include/hardware/bl808.h"
    SSOFT_IRQn = 1, /*!< 1 RISCV supervisor software Interrupt                             */
    MSOFT_IRQn = 3, /*!< 3 RISCV machine software Interrupt                                */
    STIME_IRQn = 5, /*!< 5 RISCV supervisor time Interrupt                                 */
    MTIME_IRQn = 7, /*!< 7 RISCV machine time Interrupt                                    */
    SEXT_IRQn = 9, /*!< 9 RISCV S-mode external  Interrupt                                */
    MEXT_IRQn = 11, /*!< 11 RISCV M-mode external  Interrupt                               */
    CLIC_SOFT_PEND_IRQn = 12, /*!< 12 RISCV CLIC software pending  Interrupt                         */
# 78 "../bouffalo_drivers/soc/bl808/std/include/hardware/bl808.h"
    /******  BL808 specific Interrupt Numbers **********************************************************************/
    BMX_MCU_BUS_ERR_IRQn = 16 + 0, /*!< bmx mcu bus_err_int Interrupt                                     */
    BMX_MCU_TO_IRQn = 16 + 1, /*!< bmx_timeout_int|mcu_timeout_int Interrupt                         */
    M0_RESERVED2_IRQn = 16 + 2, /*!< reserved Interrupt                                                */
    IPC_M0_IRQn = 16 + 3, /*!< ipc0_m0_irq Interrupt                                             */
    AUDIO_IRQn = 16 + 4, /*!< Audio Interrupt                                                   */
    RF_TOP_INT0_IRQn = 16 + 5, /*!< RF_TOP_INT0 Interrupt                                             */
    RF_TOP_INT1_IRQn = 16 + 6, /*!< RF_TOP_INT1 Interrupt                                             */
    LZ4D_IRQn = 16 + 7, /*!< LZ4 decompressor Interrupt                                        */
    GAUGE_ITF_IRQn = 16 + 8, /*!< gauge_itf_int Interrupt                                           */
    SEC_ENG_ID1_SHA_AES_TRNG_PKA_GMAC_IRQn = 16 + 9, /*!< sec_eng_id1 Interrupt                                             */
    SEC_ENG_ID0_SHA_AES_TRNG_PKA_GMAC_IRQn = 16 + 10, /*!< sec_eng_id0 Interrupt                                             */
    SEC_ENG_ID1_CDET_IRQn = 16 + 11, /*!< sec_eng_id1_cdet  Interrupt                                       */
    SEC_ENG_ID0_CDET_IRQn = 16 + 12, /*!< sec_eng_id0_cdet Interrupt                                        */
    SF_CTRL_ID1_IRQn = 16 + 13, /*!< sf_ctrl_id1 Interrupt                                             */
    SF_CTRL_ID0_IRQn = 16 + 14, /*!< sf_ctrl_id0 Interrupt                                             */
    DMA0_ALL_IRQn = 16 + 15, /*!< DMA0_INTR_ALL Interrupt                                           */
    DMA1_ALL_IRQn = 16 + 16, /*!< DMA1_INTR_ALL Interrupt                                           */
    SDH_IRQn = 16 + 17, /*!< sdh Interrupt                                                     */
    MM_ALL_IRQn = 16 + 18, /*!< MM System All Interrupt                                           */
    IRTX_IRQn = 16 + 19, /*!< IR TX Interrupt                                                   */
    IRRX_IRQn = 16 + 20, /*!< IR RX Interrupt                                                   */
    USB_IRQn = 16 + 21, /*!< USB  Interrupt                                                    */
    AUPDM_TOUCH_IRQn = 16 + 22, /*!< aupdm_touch_int Interrupt                                         */
    M0_RESERVED23_IRQn = 16 + 23, /*!< reserved Interrupt                                                */
    EMAC_IRQn = 16 + 24, /*!< EMAC  Interrupt                                                   */
    GPADC_DMA_IRQn = 16 + 25, /*!< GPADC_DMA Interrupt                                               */
    EFUSE_IRQn = 16 + 26, /*!< Efuse Interrupt                                                   */
    SPI0_IRQn = 16 + 27, /*!< SPI0  Interrupt                                                   */
    UART0_IRQn = 16 + 28, /*!< UART0 Interrupt                                                   */
    UART1_IRQn = 16 + 29, /*!< UART1 Interrupt                                                   */
    UART2_IRQn = 16 + 30, /*!< UART2 Interrupt                                                   */
    GPIO_DMA_IRQn = 16 + 31, /*!< GPIO DMA Interrupt                                                */
    I2C0_IRQn = 16 + 32, /*!< I2C0  Interrupt                                                   */
    PWM_IRQn = 16 + 33, /*!< PWM Interrupt                                                     */
    IPC_RSVD_IRQn = 16 + 34, /*!< ipc reserved Interrupt                                            */
    IPC_LP_IRQn = 16 + 35, /*!< ipc lp_irq Interrupt                                              */
    TIMER0_CH0_IRQn = 16 + 36, /*!< Timer0 Channel 0 Interrupt                                        */
    TIMER0_CH1_IRQn = 16 + 37, /*!< Timer0 Channel 1 Interrupt                                        */
    TIMER0_WDT_IRQn = 16 + 38, /*!< Timer0 Watch Dog Interrupt                                        */
    I2C1_IRQn = 16 + 39, /*!< I2C1  Interrupt                                                   */
    I2S_IRQn = 16 + 40, /*!< I2S  Interrupt                                                    */
    ANA_OCP_OUT_TO_CPU_0_IRQn = 16 + 41, /*!< ana_ocp_out_to_cpu_irq0 Interrupt                                 */
    ANA_OCP_OUT_TO_CPU_1_IRQn = 16 + 42, /*!< ana_ocp_out_to_cpu_irq1 Interrupt                                 */
    ANA_OCP_OUT_TO_CPU_2_IRQn = 16 + 43, /*!< ana_ocp_out_to_cpu_irq2 Interrupt                                 */
    GPIO_INT0_IRQn = 16 + 44, /*!< GPIO Interrupt                                                    */
    DM_IRQn = 16 + 45, /*!< DM Interrupt                                                      */
    BT_IRQn = 16 + 46, /*!< BT Interrupt                                                      */
    M154_REQ_ACK_IRQn = 16 + 47, /*!< M154 req enh ack Interrupt                                        */
    M154_INT_IRQn = 16 + 48, /*!< M154 Interrupt                                                    */
    M154_AES_IRQn = 16 + 49, /*!< m154 aes Interrupt                                                */
    PDS_WAKEUP_IRQn = 16 + 50, /*!< PDS Wakeup Interrupt                                              */
    HBN_OUT0_IRQn = 16 + 51, /*!< Hibernate out 0 Interrupt                                         */
    HBN_OUT1_IRQn = 16 + 52, /*!< Hibernate out 1 Interrupt                                         */
    BOR_IRQn = 16 + 53, /*!< BOR Interrupt                                                     */
    WIFI_IRQn = 16 + 54, /*!< WIFI To CPU Interrupt                                             */
    BZ_PHY_INT_IRQn = 16 + 55, /*!< BZ phy Interrupt                                                  */
    BLE_IRQn = 16 + 56, /*!< BLE Interrupt                                                     */
    MAC_TXRX_TIMER_IRQn = 16 + 57, /*!< MAC Tx Rx Timer Interrupt                                         */
    MAC_TXRX_MISC_IRQn = 16 + 58, /*!< MAC Tx Rx Misc Interrupt                                          */
    MAC_RX_TRG_IRQn = 16 + 59, /*!< MAC Rx Trigger Interrupt                                          */
    MAC_TX_TRG_IRQn = 16 + 60, /*!< MAC tx Trigger Interrupt                                          */
    MAC_GEN_IRQn = 16 + 61, /*!< MAC Gen Interrupt                                                 */
    MAC_PORT_TRG_IRQn = 16 + 62, /*!< MAC Prot Trigger Interrupt                                        */
    WIFI_IPC_PUBLIC_IRQn = 16 + 63, /*!< WIFI Ipc Interrupt                                                */
    IRQn_LAST,
# 217 "../bouffalo_drivers/soc/bl808/std/include/hardware/bl808.h"
} IRQn_Type;

/* Add following macro definition in order to pass the compilation */

#define BMX_DSP_BUS_ERR_IRQn (IRQn_LAST)
#define D0_RESERVED1_IRQn (IRQn_LAST)
#define D0_RESERVED2_IRQn (IRQn_LAST)
#define UART3_IRQn (IRQn_LAST)
#define I2C2_IRQn (IRQn_LAST)
#define I2C3_IRQn (IRQn_LAST)
#define SPI1_IRQn (IRQn_LAST)
#define D0_RESERVED4_IRQn (IRQn_LAST)
#define D0_RESERVED5_IRQn (IRQn_LAST)
#define SEOF_INT0_IRQn (IRQn_LAST)
#define SEOF_INT1_IRQn (IRQn_LAST)
#define SEOF_INT2_IRQn (IRQn_LAST)
#define DVP2BUS_INT0_IRQn (IRQn_LAST)
#define DVP2BUS_INT1_IRQn (IRQn_LAST)
#define DVP2BUS_INT2_IRQn (IRQn_LAST)
#define DVP2BUS_INT3_IRQn (IRQn_LAST)
#define H264_BS_IRQn (IRQn_LAST)
#define H264_FRAME_IRQn (IRQn_LAST)
#define H264_SEQ_DONE_IRQn (IRQn_LAST)
#define MJPEG_IRQn (IRQn_LAST)
#define H264_S_BS_IRQn (IRQn_LAST)
#define H264_S_FRAME_IRQn (IRQn_LAST)
#define H264_S_SEQ_DONE_IRQn (IRQn_LAST)
#define DMA2_INT0_IRQn (IRQn_LAST)
#define DMA2_INT1_IRQn (IRQn_LAST)
#define DMA2_INT2_IRQn (IRQn_LAST)
#define DMA2_INT3_IRQn (IRQn_LAST)
#define DMA2_INT4_IRQn (IRQn_LAST)
#define DMA2_INT5_IRQn (IRQn_LAST)
#define DMA2_INT6_IRQn (IRQn_LAST)
#define DMA2_INT7_IRQn (IRQn_LAST)
#define SDH_MMC1_IRQn (IRQn_LAST)
#define SDH_MMC3_IRQn (IRQn_LAST)
#define SDH2PMU_WAKEUP1_IRQn (IRQn_LAST)
#define SDH2PMU_WAKEUP3_IRQn (IRQn_LAST)
#define EMAC2_IRQn (IRQn_LAST)
#define MIPI_CSI_IRQn (IRQn_LAST)
#define IPC_D0_IRQn (IRQn_LAST)
#define APU_IRQn (IRQn_LAST)
#define MJDEC_IRQn (IRQn_LAST)
#define DVP2BUS_INT4_IRQn (IRQn_LAST)
#define DVP2BUS_INT5_IRQn (IRQn_LAST)
#define DVP2BUS_INT6_IRQn (IRQn_LAST)
#define DVP2BUS_INT7_IRQn (IRQn_LAST)
#define DMA2D_INT0_IRQn (IRQn_LAST)
#define DMA2D_INT1_IRQn (IRQn_LAST)
#define DISPLAY_IRQn (IRQn_LAST)
#define SEOF_INT3_IRQn (IRQn_LAST)
#define RESERVED1_IRQn (IRQn_LAST)
#define RESERVED2_IRQn (IRQn_LAST)
#define OSD_IRQn (IRQn_LAST)
#define DBI_IRQn (IRQn_LAST)
#define D0_RESERVED6_IRQn (IRQn_LAST)
#define OSDA_BUS_DRAIN_IRQn (IRQn_LAST)
#define OSDB_BUS_DRAIN_IRQn (IRQn_LAST)
#define OSD_PB_IRQn (IRQn_LAST)
#define D0_RESERVED7_IRQn (IRQn_LAST)
#define MIPI_DSI_IRQn (IRQn_LAST)
#define D0_RESERVED8_IRQn (IRQn_LAST)
#define TIMER1_CH0_IRQn (IRQn_LAST)
#define TIMER1_CH1_IRQn (IRQn_LAST)
#define TIMER1_WDT_IRQn (IRQn_LAST)
#define WL_ALL_IRQn (IRQn_LAST)
#define PDS_IRQn (IRQn_LAST)
# 352 "../bouffalo_drivers/soc/bl808/std/include/hardware/bl808.h"
/**
 * @brief BL808 Memory Map Definitions
 */
#define BL808_OCRAM_BASE (0x22020000)
#define BL808_OCRAM_END (0x22020000 + 64 * 1024)
#define BL808_OCRAM_CACHEABLE_BASE (0x62020000)
#define BL808_OCRAM_CACHEABLE_END (0x62020000 + 64 * 1024)

#define BL808_WRAM_BASE (0x22030000)
#define BL808_WRAM_END (0x22030000 + 160 * 1024)
#define BL808_WRAM_CACHEABLE_BASE (0x62030000)
#define BL808_WRAM_CACHEABLE_END (0x62030000 + 160 * 1024)

